Engimusing/engimusing-firmware/cortex-m0plus/1.0.1/boards.txt
# Copyright (c) 2015 Engimusing LLC.  All right reserved.
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

engimusing_efm32zgusb.name=Engimusing EFM32ZGUSB
engimusing_efm32zgusb.upload.tool=efm_upload
engimusing_efm32zgusb.upload.protocol=xmodem
engimusing_efm32zgusb.upload.maximum_size=27648
engimusing_efm32zgusb.bootloader.tool=
engimusing_efm32zgusb.bootloader.file=
engimusing_efm32zgusb.build.mcu=cortex-m0plus
engimusing_efm32zgusb.build.board=EFM32ZGUSB
engimusing_efm32zgusb.build.core=efm32
engimusing_efm32zgusb.build.ldscript=efm32_32K4K.ld
engimusing_efm32zgusb.build.variant=EFMUSB
engimusing_efm32zgusb.build.variant_system_lib=
engimusing_efm32zgusb.compiler.device=-DEFM32ZG222F32

engimusing_efm32zg108.name=Engimusing EFM32ZG108
engimusing_efm32zg108.upload.tool=efm_upload
engimusing_efm32zg108.upload.protocol=xmodem
engimusing_efm32zg108.upload.maximum_size=27648
engimusing_efm32zg108.bootloader.tool=
engimusing_efm32zg108.bootloader.file=
engimusing_efm32zg108.build.mcu=cortex-m0plus
engimusing_efm32zg108.build.board=EFM32ZG108
engimusing_efm32zg108.build.core=efm32
engimusing_efm32zg108.build.ldscript=efm32_32K4K.ld
engimusing_efm32zg108.build.variant=EFM32ZG108
engimusing_efm32zg108.build.variant_system_lib=
engimusing_efm32zg108.compiler.device=-DEFM32ZG108F32


